Revit 2027 API
Curve.GetEndPoint Method
 Returns the 3D point at the start or end of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetEndPoint(
	int index
)
Public Function GetEndPoint (
	index As Integer
) As XYZ
public:
XYZ^ GetEndPoint(
	int index
)
member GetEndPoint :
        index : int -> XYZ
Parameters
index Int32
 0 for the start or 1 for end of the curve.
Return Value
XYZ
 The curve endpoint.
Exceptions
Exception | Condition
ArgumentException |  curve is unbound and does not have start and end points. -or- index must be 0 for the start of the curve or 1 for the end.
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace